{
  "title": "Currency rates application",
  "titleColumnCurrency":"Rates", 
  "titleColumnHistoryCurrency":"History of rates in relation to the selected currency",
  "currency": "Currency:",
  "titleColumn": "Title",
  "publishedAtColumn": "Published At",
  "descriptionColumn": "Description",
  "checkButton": "Check",
  "link": "Article Link",
  "app.languagePl": "Polish",
  "app.languageEn": "English",
  "app.languageNo": "Norwegian",
  "header.list": "List",
  "header.tiles": "Tiles",
  "header.info": "Info",

  "footer.count": "Count articles: ",
  "footer.currentTime": "Current time: ",
  "popup.author": "Author:",
  "popup.source": "Source:",
  "spiner.loading": "Loading...",
  "title.homePage": "Home Page",
  "home.howToUse.title": "How to Use:",
  "requiredInstall": "Please run the application locally as the developer version may not work correctly due to API limitations and possible CORS (Cross-Origin Resource Sharing) errors. By running the application locally, we avoid these issues and can take advantage of the full functionality.",
  "home.howToUse.step1": "On the left side, you will find a list of countries. Click on a country to view the corresponding news articles.",
  "home.howToUse.step2": "A reactive table will appear with news articles related to the selected country.",
  "home.howToUse.step3": "Click on a news article to navigate to its details within the application.",
  "home.howToUse.step4": "Within the application, you can also switch between different languages to view the content in your preferred language.",
  "home.technologiesUsed.title": "Technologies Used:",
  "home.technologiesUsed.react": "React: A JavaScript library for building user interfaces.",
  "home.technologiesUsed.typescript": "TypeScript: A typed superset of JavaScript that helps improve code quality and developer productivity.",
  "home.technologiesUsed.reactRouter": "React Router: A routing library for declarative navigation within a React application.",
  "home.technologiesUsed.esLint": "I used the Eslint tool for static code analysis and linting to ensure consistency, readability, and adherence to established standards. Eslint helps identify and correct potential errors, style inconsistencies, and poor coding practices. This tool allowed me to maintain a high code quality and avoid potential issues during application development. Furthermore, thanks to Eslint, I was able to avoid problems when deploying the application on a free hosting platform. The tool assists in detecting and fixing potential issues, such as dependency problems, library version conflicts, and incorrect imports. These corrections ensured that my application functioned properly, even in a limited hosting environment.",
  "home.technologiesUsed.otherLibraries": "Other libraries and tools specific to your project may be listed here.",
  "home.apiInfo": "I utilized this API because I wanted to add language selection functionality to my application. However, the API didn't have a proper article ID, so I decided to use the article title as the identifier. As a result, I couldn't fetch a single article directly through the REST API. I had to find a workaround and retrieve articles based on their title from my reducer. I'm aware that using a books API could have been better, or perhaps more convenient, for accomplishing this task, but it wasn't a problem for me."
}
