{
    "title": "Artikkelsøk",
    "titleColumn": "Tittel",
    "publishedAtColumn": "Publisert",
    "descriptionColumn": "Beskrivelse",
    "checkButton": "Sjekk",
    "link": "Artikkelkobling",
    "app.languagePl": "Polsk",
    "app.languageEn": "Engelsk",
    "app.languageNo": "Norsk",
    "header.list": "Liste",
    "header.tiles": "Fliser",
    "header.info": "Info",
    "header.infoTitle": "Vanskeligheter og gleder",
    "footer.count": "Antall artikler: ",
    "footer.currentTime": "Klokka: ",
    "popup.author": "Forfatter:",
    "popup.source": "Kilde:",
    "spiner.loading": "Laster...",
    "title.homePage": "Hjemmeside",
    "home.howToUse.title": "Hvordan bruke:",
    "requiredInstall": "Vennligst kjør applikasjonen lokalt da utviklerversjonen kan ha begrensninger og mulige CORS (Cross-Origin Resource Sharing) feil. Ved å kjøre applikasjonen lokalt unngår vi disse problemene og kan dra nytte av all funksjonalitet.",
    "home.howToUse.step1": "På venstre side er det en liste over land. Klikk på et land for å se relaterte nyhetsartikler.",
    "home.howToUse.step2": "Etter å ha klikket på et land, vises en responsiv tabell med nyhetsartikler relatert til det valgte landet.",
    "home.howToUse.step3": "Klikk på en nyhetsartikkel for å gå til detaljene i applikasjonen.",
    "home.howToUse.step4": "I applikasjonen kan du også bytte mellom forskjellige språk for å vise innhold på ønsket språk.",
    "home.technologiesUsed.title": "Brukte teknologier:",
    "home.technologiesUsed.react": "React: JavaScript-bibliotek for å bygge brukergrensesnitt.",
    "home.technologiesUsed.typescript": "TypeScript: Typet overmengde av JavaScript som bidrar til å forbedre kodekvaliteten og utviklerproduktiviteten.",
    "home.technologiesUsed.reactRouter": "React Router: Routing-bibliotek for deklarativ navigasjon i React-applikasjoner.",
    "home.technologiesUsed.esLint": "Jeg brukte Eslint-verktøyet til statisk kodeanalyse og linting for å sikre konsistens, lesbarhet og overholdelse av etablerte standarder. Eslint hjelper til med å identifisere og korrigere potensielle feil, stilinkonsistenser og dårlige kodingspraksiser. Dette verktøyet gjorde det mulig for meg å opprettholde høy kodekvalitet og unngå potensielle problemer under applikasjonsutvikling. Videre, takket være Eslint, klarte jeg å unngå problemer ved distribusjon av applikasjonen på en gratis hosting-plattform. Verktøyet hjelper til med å oppdage og rette potensielle problemer, som avhengighetsproblemer, konflikter mellom biblioteksversjoner og feilaktige importeringer. Disse korrigeringene sikret at applikasjonen min fungerte korrekt, selv i et begrenset hosting-miljø.",
    "home.technologiesUsed.otherLibraries": "Andre prosjektspecifikke biblioteker og verktøy kan nevnes her.",
    "home.apiInfo": "Jeg brukte dette API-et fordi jeg ønsket å legge til muligheten for å velge språk i applikasjonen min. Dessverre inkluderte ikke dette API-et en passende artikkel-ID, så jeg bestemte meg for å bruke artikkelens tittel som en ID. Derfor kunne jeg ikke direkte hente en enkeltartikkel ved hjelp av REST API-et. Jeg måtte finne en omvei og hente artikler basert på tittelen fra redux. Jeg vet at et bok-API kanskje kunne vært bedre og enklere å bruke for denne oppgaven, men det var ikke et problem for meg."
}
