{
    "title": "Wyszukiwarka artykułów",
    "titleColumn": "Tytuł",
    "publishedAtColumn": "Data publikacji",
    "descriptionColumn": "Opis",
    "checkButton": "Sprawdź",
    "link": "Link do artykułu",
    "app.languagePl": "Polski",
    "app.languageEn": "Angielski",
    "app.languageNo": "Norweski",
    "header.list": "Lista",
    "header.tiles": "Kafelki",
    "header.info": "Info",
    "header.infoTitle":"Trudności i frajdy",
    "footer.count": "Liczba artykułów: ",
    "footer.currentTime": "Godzina: ",
    "popup.author": "Autor:",
    "popup.source": "Zródło:",
    "spiner.loading": "Wczytywanie...",
    "title.homePage": "Strona główna",
    "home.howToUse.title": "Jak korzystać:",
    "requiredInstall": "Proszę uruchomić aplikację lokalnie, ponieważ wersja deweloperska może nie działać poprawnie z powodu ograniczeń API i możliwego występowania błędów CORS (Cross-Origin Resource Sharing). W przypadku uruchamiania aplikacji lokalnie unikamy tych problemów i możemy skorzystać z pełnej funkcjonalności.",
    "home.howToUse.step1": "Po lewej stronie znajduje się lista krajów. Kliknij na kraj, aby zobaczyć powiązane z nim artykuły newsowe.",
    "home.howToUse.step2": "Po kliknięciu na kraj pojawi się reaktywna tabela z artykułami newsowymi związanych z wybranym krajem.",
    "home.howToUse.step3": "Kliknij na artykuł newsowy, aby przejść do jego szczegółów w aplikacji.",
    "home.howToUse.step4": "W aplikacji możesz również przełączać się między różnymi językami, aby wyświetlać treści w preferowanym języku.",
    "home.technologiesUsed.title": "Wykorzystane technologie:",
    "home.technologiesUsed.react": "React: Biblioteka JavaScript do budowy interfejsów użytkownika.",
    "home.technologiesUsed.typescript": "TypeScript: Typowany nadzbiór języka JavaScript, który pomaga poprawić jakość kodu i produktywność programisty.",
    "home.technologiesUsed.reactRouter": "React Router: Biblioteka routowania do deklaratywnej nawigacji w aplikacji React.",
    "home.technologiesUsed.esLint": "Użyłem narzędzia Eslint do przeprowadzenia statycznej analizy i lintowania mojego kodu w celu zapewnienia spójności, czytelności i zgodności z ustalonymi standardami. Eslint pomaga w identyfikowaniu i poprawianiu potencjalnych błędów, niezgodności ze stylem kodu oraz złych praktyk programistycznych. Dzięki temu narzędziu mogłem utrzymać wysoką jakość mojego kodu i uniknąć potencjalnych problemów podczas tworzenia aplikacji.Dodatkowo, dzięki Eslintowi, byłem w stanie uniknąć problemów z uruchomieniem aplikacji na darmowym hostingu. Narzędzie to pomaga w wykrywaniu i poprawianiu potencjalnych błędów, takich jak problemy z zależnościami, niezgodność wersji bibliotek czy nieprawidłowe importy. Dzięki tym korektom, byłem pewien, że moja aplikacja działa poprawnie, nawet na ograniczonym środowisku hostingowym.",
    "home.technologiesUsed.otherLibraries": "Inne biblioteki i narzędzia specyficzne dla projektu mogą być tutaj wymienione.",
    "home.apiInfo": "Wykorzystałem te API, ponieważ chciałem dodać możliwość wyboru języka w mojej aplikacji. Niestety, to API nie zawierało właściwego identyfikatora dla artykułu, dlatego postanowiłem użyć tytułu artykułu jako identyfikatora. Z tego powodu nie mogłem bezpośrednio pobrać pojedynczego artykułu za pomocą REST API. Musiałem więc znaleźć obejście i pobierać artykuły na podstawie tytułu z mojego reduktora. Wiem, że API dla książek mogłoby być lepsze, a może nawet wygodniejsze, do wykonania tego zadania, ale nie było to dla mnie problemem."
  }